In [1]:
from env import get_url_for_pancakes

import pandas as pd
import numpy as np

import wrangle

# Acquire customer_id, monthly_charges, tenure, and total_charges from telco_churn database for all customers with a 2 year contract.

In [2]:
query = '''
SELECT customer_id, monthly_charges, tenure, total_charges, contract_type
FROM customers
JOIN contract_types USING(contract_type_id)
'''

url = get_url_for_pancakes("telco_churn")

telco = pd.read_sql(query, url)

In [3]:
telco.head()

  customer_id  monthly_charges  tenure total_charges   contract_type
0  0003-MKNFE             59.9       9         542.4  Month-to-month
1  0004-TLHLJ             73.9       4        280.85  Month-to-month
2  0011-IGKFF             98.0      13       1237.85  Month-to-month
3  0013-EXCHZ             83.9       3         267.4  Month-to-month
4  0013-MHZWF             69.4       9        571.45  Month-to-month

In [4]:
telco = telco[telco.contract_type == 'Two year'][['monthly_charges', 'tenure', 'total_charges']]

In [5]:
telco.head()

      monthly_charges  tenure total_charges
5348           109.70      71       7904.25
5349            84.65      63        5377.8
5350            90.45      65        5957.9
5351            45.20      54       2460.55
5352           116.80      72       8456.75

In [6]:
telco.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1695 entries, 5348 to 7042
Data columns (total 3 columns):
monthly_charges    1695 non-null float64
tenure             1695 non-null int64
total_charges      1695 non-null object
dtypes: float64(1), int64(1), object(1)
memory usage: 53.0+ KB

In [7]:
telco.total_charges.min()

' '

In [8]:
telco = telco.replace(' ', np.nan)

In [9]:
telco.total_charges.isna().sum()

10

In [10]:
telco = telco[~ telco.total_charges.isna()]
telco.total_charges = telco.total_charges.astype(float)
telco.total_charges.isna().sum()

0

In [11]:
telco.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1685 entries, 5348 to 7042
Data columns (total 3 columns):
monthly_charges    1685 non-null float64
tenure             1685 non-null int64
total_charges      1685 non-null float64
dtypes: float64(2), int64(1)
memory usage: 52.7 KB

In [12]:
def get_sql_data():
    query = '''
    SELECT customer_id, monthly_charges, tenure, total_charges, contract_type
    FROM customers
    JOIN contract_types USING(contract_type_id)
    '''

    url = get_url_for_pancakes("telco_churn")

    df = pd.read_sql(query, url)
    return df

In [13]:
def wrangle_telco():
    df = get_sql_data()    
    df = df[df.contract_type == 'Two year'][['monthly_charges', 'tenure', 'total_charges']]
    df = df.replace(' ', np.nan)
    df = df[~ df.total_charges.isna()]
    df.total_charges = df.total_charges.astype(float)
    
    return df

In [14]:
wrangle_telco()

      monthly_charges  tenure  total_charges
5348           109.70      71        7904.25
5349            84.65      63        5377.80
5350            90.45      65        5957.90
5351            45.20      54        2460.55
5352           116.80      72        8456.75
...               ...     ...            ...
7038            24.40      71        1725.40
7039            19.25      67        1372.90
7040            19.75      46         856.50
7041            67.85      67        4627.65
7042            59.00      63        3707.60

[1685 rows x 3 columns]